app/controllers/events_controller.rb

INSERT INTO "events" ("description", "date", "place", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["description", "Frites"], ["date", "2018-05-09 00:00:00"], ["place", "Paris"], ["created_at", "2018-05-07 15:22:25.800281"], ["updated_at", "2018-05-07 15:22:25.800281"], ["creator_id", 2]]
---
	def create
		@user = current_user
		@event = Event.new(event_params)
		@event.creator_id = current_user.id
		@event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def subscribe
		@user = current_user
		@event = Event.find(params[:id])
	    if @event.attendees.include? current_user